research/report/plan.org
#+TITLE: Report rough plan

# Current word count:

#+begin_src bash
./wordcount.sh
#+end_src
#+RESULTS:
: 8304

* Sections [1/8]:
** [ ] Abstract [1/1]
#+begin_src bash
texcount abstract.tex  \
    | grep "Words in text:" \
    | tail -1 \
    | cut -d : -f2 \
    | sed 's/ //g'
#+end_src

#+RESULTS:
: 0

** [ ] Introduction [0/0]
#+begin_src bash
texcount introduction.tex  \
    | grep "Words in text:" \
    | tail -1 \
    | cut -d : -f2 \
    | sed 's/ //g'
#+end_src

#+RESULTS:
: 213

** [X] Background [0/1]
#+begin_src bash
texcount background.tex  \
    | grep "Words in text:" \
    | tail -1 \
    | cut -d : -f2 \
    | sed 's/ //g'
#+end_src

#+RESULTS:
: 1805
- [-] Make sure all techniques used are properly documented in this section

** [-] Literature Review [2/3]
#+begin_src bash
texcount literature_review.tex  \
    | grep "Words in text:" \
    | tail -1 \
    | cut -d : -f2 \
    | sed 's/ //g'
#+end_src

#+RESULTS:
: 985

- [X] Bezier curves for route generation
- [X] GAs for route generation
- [ ] FARNs

#+RESULTS:
: 985

** [-] Approach [2/3]
#+begin_src bash
texcount classical_approach.tex  \
    | grep "Words in text:" \
    | tail -1 \
    | cut -d : -f2 \
    | sed 's/ //g'
#+end_src

#+RESULTS:
: 3900
*** [X] Single Agent Planning [4/4]
- [X] Population encoding
- [X] Population generation
- [X] Fitness evaluation
- [X] Genetic operators
*** [X] Multi-Agent Planning [2/2]
- [X] Intersection Detection
- [X] Collision Detection
*** [ ] Macro-Level Planning [3/5]
:LOGBOOK:
CLOCK: [2021-04-15 Thu 14:13]--[2021-04-15 Thu 14:38] =>  0:25
CLOCK: [2021-04-10 Sat 15:05]--[2021-04-10 Sat 15:30] =>  0:25
CLOCK: [2021-04-10 Sat 14:35]--[2021-04-10 Sat 15:00] =>  0:25
CLOCK: [2021-04-09 Fri 10:36]--[2021-04-09 Fri 11:01] =>  0:25
:END:
- [X] Graph construction & Edge weighting + possible extensions
- [X] Planning macro routes
- [X] grouping agents into concurrent plans
- [ ] Possible extensions
- [ ] Make clear what is my original work
** [ ] Results [2/3]
DEADLINE: <2021-05-03 Mon>
*** [X] Single Agent
- [X] population size
- [X] number of generations
- [X] number of obstacles / difficulty of road space
    % of road space that is infeasible
    average number of (required) control points to plan route
    How close is the average fitness to optimal (straight line fitness)
*** [X] Multi Agent
- [X] population size
- [X] number of generations
- [X] number of obstacles / difficulty of road space
- [X] number of concurrently planned agents
*** [ ] Macro Level

** [ ] Evaluation [2/6]
#+begin_src bash
texcount evaluation.tex  \
    | grep "Words in text:" \
    | tail -1 \
    | cut -d : -f2 \
    | sed 's/ //g'
#+end_src


#+RESULTS:
: 1647
*** [ ] Genetic Algorithms
- [-] Evaluation of currently implemented operators
  - [X] Selection
  - [X] Mutation
  - [X] Crossover
  - [X] Fitness
  - [-] Other operators and how they may improve
  - [-] Performance
  - [ ] alternative approaches to the problem
*** [X] Bezier Curves
- [X] Advantages
- [X] Disadvantages
- [X] Alternatives
*** [X] Single agent approach
- [X] How well did it perform?
- [X] How could it be further improved?
- [X] Compared to previous work
*** [ ] Multi-agent approach
- [X] How well did it perform?
- [ ] How could it be further improved?
- [ ] Compared to previous work
*** [ ] macro level approach
- [ ] How well did it perform?
- [ ] How could it be further improved?
- [ ] Compared to previous work
*** [ ] Codebase evaluation
- [ ] How much work was involved, size of codebase?
- [ ] Where does my approach fall short?

** [ ] Conclusion [0/0]
#+begin_src bash
texcount conclusion.tex  \
    | grep "Words in text:" \
    | tail -1 \
    | cut -d : -f2 \
    | sed 's/ //g'
#+end_src

#+RESULTS:
: 0
